"AES-128 (recommended)" = "AES-128 (suositeltu)";
"Burn Image..." = "Polta levytiedosto...";
"Cancel" = "Kumoa";
"Change Format..." = "Muunna levytiedosto...";
"Convert" = "Muunna";
"Converting Image..." = "Muunnetaan levytiedosto...";
"Create" = "Luo";
"Create Disk Image" = "Levytiedosto";
"Create with directory:" = "Luo hakemistolla:";
"Create with size:" = "Luo kokoon:";
"Create..." = "Uusi levytiedosto…";
"Creating Image..." = "Luodaan levytiedostoa...";
"DVD/CD-R master" = "Alkuperäinen DVD/CD-R";
"Disk Image" = "Levytiedosto";
"Disk Image Converter" = "Levytiedoston muuntaja";
"Disk Image Converting" = "Levytiedoston muuntaminen";
"Disk Image Progress" = "Levytiedoston edistyminen";
"Encryption:" = "Salaus:";
"Finished" = "Valmis";
"Format:" = "Muoto:";
"Image Format" = "Muunna levytiedosto muotoon:";
"Internet enable" = "Valmistele Internet-käyttöön";
"Megabytes" = "megatavua";
"Mount after creating" = "Tuo näkyviin luonnin jälkeen";
"Mounting Image..." = "Tuodaan levytiedosto näkyviin...";
"Name:" = "Nimi:";
"None" = "Ei mitään";
"Read only" = "Vain luku";
"Read only compressed" = "Vain luku, pakattu";
"Read only zlib compressed" = "Vain luku, zlib-pakattu";
"Read/Write" = "Luku/kirjoitus";
"Sparse" = "Harva";
"The file must have the .dmg, .img, .cdr, .iso, .smi or .toast extensions." = "Tiedostotarkenteen on oltava  .dmg, .img, .cdr, .iso, .smi tai .toast.";
"Volume Name:" = "Taltion nimi:";
"Volume Size:" = "Taltion koko:";
"untitled" = "nimetön";
